tip_str = '''
        +-----------------------------+
        |1)添加学生信息               |
        |2)显示所有学生的信息         |
        |3)删除学生信息               |
        |4)修改学生成绩               |
        |5)按学生成绩高-低显示学生信息|
        |6)按学生成绩低-高显示学生信息|
        |7)按学生年龄高-低显示学生信息|
        |8)按学生年龄低-高显示学生信息|
        |9)保存学生信息到文件(si.txt) |
        |10)从文件中读取数据(si.txt)  |
        |11)修改学生的家庭住址        |
        |q)退出                       |
        +-----------------------------+
    '''
def show_menu():
    print(tip_str)